Repository: MrAbraham98/accounts-case
Catalog: lib/utils/localization/l10n/app_*.arb
Languages: tr

# accounts_title
source: Accounts
tr: Hesaplar

source: English
tr: Ingilizce

source: Turkish
tr: Turkce

source: Ok
tr: Tamam

# name_label
source: Name
tr: Isim

# surname_label
source: Surname
tr: Soyisim

# birthday_label
source: Birthdate day/month/year
tr: Dogum Tarihi gun/ay/yil

# sallary_label
source: Sallary
tr: Maas

# phonenumber_label
source: Phone Number
tr: Telefon Numarasi

# identity_label
source: Identity
tr: TC numarasi

# update_button
source: Update
tr: Guncelle

# create_button
source: Create
tr: Olustur

# errorDioConnectTimeout
source: An error occurred in server communication. Please try again later (Error code: 4)
tr: Sunucu iletişiminde bir hata oluştu. Lütfen daha sonra tekrar deneyiniz (Hata kodu: 4)

# errorDioReceiveTimeout
source: An error occurred in server communication. Please try again later (Error code: 5)
tr: Sunucu iletişiminde bir hata oluştu. Lütfen daha sonra tekrar deneyiniz (Hata kodu: 5)

# errorDioSendTimeout
source: An error occurred in server communication. Please try again later (Error code: 6)
tr: Sunucu iletişiminde bir hata oluştu. Lütfen daha sonra tekrar deneyiniz (Hata kodu: 6)

# errorConnection
source: Could not connect to the server.Please check your internet connection (Error code: 7)
tr: Serverla baglanti kurulamadi.İnternet bağlantınızı lütfen kontrol ediniz (Hata kodu: 7)

# errorSystem
source: An error has occurred in the system. Please try again later (Error code: {code})
tr: Sistemde bir hata oluştu. Lütfen daha sonra tekrar deneyiniz (Hata kodu: {code})

# errorDateFormat
source: Please enter the date in the correct format
tr: Lutfen tarihi dogru formatta giriniz.

# errorFailureFormat
source: Please enter your ID information as 11 digits.
tr: lutfen kimlik bilgisini 11 haneli olacak sekilde giriniz
